In [41]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva','banti'],
    'Age': [25, 30, 35, 40, 28,30],
    'Salary': [50000, 60000, 70000, 80000, 55000,90000],
    'Dept': ['HR', 'IT', 'Finance', 'IT', 'HR','gmarketing']
}

df=pd.DataFrame(data)
df

      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

In [42]:
print(df)
print("===================================================")
df1=df.sort_values('Age')
print(df1)

      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing
===================================================
      Name  Age  Salary        Dept
0    Alice   25   50000          HR
4      Eva   28   55000          HR
1      Bob   30   60000          IT
5    banti   30   90000  gmarketing
2  Charlie   35   70000     Finance
3    David   40   80000          IT

In [43]:
print(df)
print("===================================================")
df2=df.sort_values('Dept')
print(df2)

      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing
===================================================
      Name  Age  Salary        Dept
2  Charlie   35   70000     Finance
0    Alice   25   50000          HR
4      Eva   28   55000          HR
1      Bob   30   60000          IT
3    David   40   80000          IT
5    banti   30   90000  gmarketing

In [44]:
print(df)
print("\n====================== sort based on Salary ======================")
df3=df.sort_values('Salary',ascending=False)
# print(df3)
print("\n====================== sort based on Dept ======================")
df4=df.sort_values('Dept',ascending=False)
# print(df4)
print("\n====================== Multiple sorts ======================")
df5=df.sort_values(['Dept','Salary'],ascending=[True,False])
print(df5)
print("\n====================== Only sort with Dept descending ======================")
df6=df.sort_values('Dept',ascending=True)
print(df6)

      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

====================== sort based on Salary ======================

====================== sort based on Dept ======================

====================== Multiple sorts ======================
      Name  Age  Salary        Dept
2  Charlie   35   70000     Finance
4      Eva   28   55000          HR
0    Alice   25   50000          HR
3    David   40   80000          IT
1      Bob   30   60000          IT
5    banti   30   90000  gmarketing

====================== Only sort with Dept descending ======================
      Name  Age  Salary        Dept
2  Charlie   35   70000     Finance
0    Alice   25   50000          HR
4      Eva   28   55000          HR
1      Bob   30   60000          IT
3    David   40   80000          IT
5    banti   30   90000  gmarketing

In [56]:
print("====================== Dataset ======================")
print(df)
print("\n====================== age>30 ======================")
df7=df[df['Age']>=30]
print(df7)
print("\n====================== busing query age>30 ======================")
df8=df.query('Age>=30')
print(df8)
print("\n====================== busing query Salary>50000 ======================")
df9=df.query('Salary>50000')
print(df9)
# print("\n====================== busing query Multi ======================")
# df10=df.query('Salary>50000 && Age>25')
# print(df10)

====================== Dataset ======================
      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

====================== age>30 ======================
      Name  Age  Salary        Dept
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
5    banti   30   90000  gmarketing

====================== busing query age>30 ======================
      Name  Age  Salary        Dept
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
5    banti   30   90000  gmarketing

====================== busing query Salary>50000 ======================
      Name  Age  Salary        Dept
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

In [66]:
print("====================== Dataset ======================")
print(df)
print("\n====================== Sample ======================")
df1=df.sample(2)
print(df1)
print("\n====================== nlarge -> Highest ======================")
df2=df.nlargest(3,'Salary')
print(df2)
# print("\n====================== nlarge -> in name ======================")
# df3=df.nlargest(2,'Name')
# print(df3)
print("\n====================== smalest ======================")
df4=df.nsmallest(2,'Salary')
print(df4)

====================== Dataset ======================
      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

====================== Sample ======================
    Name  Age  Salary        Dept
0  Alice   25   50000          HR
5  banti   30   90000  gmarketing

====================== nlarge -> Highest ======================
      Name  Age  Salary        Dept
5    banti   30   90000  gmarketing
3    David   40   80000          IT
2  Charlie   35   70000     Finance

====================== smalest ======================
    Name  Age  Salary Dept
0  Alice   25   50000   HR
4    Eva   28   55000   HR

In [72]:
print("====================== Dataset ======================")
print(df)
print("\n====================== Filter columns a ======================")
df1=df.filter(like='a')
print(df1)
print("\n====================== Filter columns A ======================")
df2=df.filter(like='A')
print(df2)
print("\n====================== Filter columns Na ======================")
df3=df.filter(like='Na')
print(df3)

====================== Dataset ======================
      Name  Age  Salary        Dept
0    Alice   25   50000          HR
1      Bob   30   60000          IT
2  Charlie   35   70000     Finance
3    David   40   80000          IT
4      Eva   28   55000          HR
5    banti   30   90000  gmarketing

====================== Filter columns a ======================
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    David   80000
4      Eva   55000
5    banti   90000

====================== Filter columns A ======================
   Age
0   25
1   30
2   35
3   40
4   28
5   30

====================== Filter columns Na ======================
      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva
5    banti